app/controllers/admins/omniauth_callbacks_controller.rb

INSERT INTO "admins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "admins" SET "updated_at" = $1, "access_token" = $2, "refresh_token" = $3 WHERE "admins"."id" = $4  [["updated_at", "2023-03-27 17:34:35.446579"], ["access_token", "[FILTERED]"], ["refresh_token", "[FILTERED]"], ["id", 1]]
---
  def google_oauth2
    admin = Admin.from_google(**from_google_params)

    if admin.present?
      sign_out_all_scopes
      flash[:success] = t('devise.omniauth_callbacks.success', kind: 'Google')

      auth = request.env["omniauth.auth"]
      admin.access_token = auth.credentials.token
      admin.expires_at = auth.credentials.expires_at
      admin.refresh_token = auth.credentials.refresh_token
      admin.save!