app/views/groups/_group.html.erb

    <% if @user_group_array.map(&:group_id).include? group.id %>
      <%= button_to "Leave", { :controller => :group_members, :id => GroupMember.where('group_id' => group.id, 'user_id' => @current_id).first.id, :action => 'destroy' }, :method => :delete %>
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = $1 AND "group_members"."user_id" = $2 ORDER BY "group_members"."id" ASC LIMIT $3  [["group_id", 5], ["user_id", 12], ["LIMIT", 1]]