app/views/groups/index.html.erb

      <% if @user_group_array.include? group.id %>
        <%= button_to "Leave Group", { :controller => :group_members, :id => group.group_members.ids.first, :action => 'destroy' }, :method => :delete %>
---
SELECT "groups".* FROM "groups"