app/views/users/index.html.erb

    <ul>
      <% user.events.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "event_members" ON "events"."id" = "event_members"."event_id" WHERE "event_members"."user_id" = $1  [["user_id", 1]]

    <ul>
      <% user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_members" ON "groups"."id" = "group_members"."group_id" WHERE "group_members"."user_id" = $1  [["user_id", 1]]