app/views/events/_event.html.erb

SELECT "event_members".* FROM "event_members" WHERE "event_members"."event_id" = $1 AND "event_members"."user_id" = $2 ORDER BY "event_members"."id" ASC LIMIT $3  [["event_id", 52], ["user_id", 12], ["LIMIT", 1]]
---
    <% if @user_event_array.map(&:event_id).include? event.id %>
      <%= button_to "Leave", { :controller => :event_members, :id => EventMember.where('event_id' => event.id, 'user_id' => @current_id).first.id, :action => 'destroy' }, :method => :delete %>