app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
      <% if @user_event_array.include? event.id %>
        <%= button_to "Leave Event", { :controller => :event_members, :id => event.event_members.ids.first, :action => 'destroy' }, :method => :delete %>