app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)

    respond_to do |format|
      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "oijlkn"], ["post_id", 8], ["parent_id", nil], ["created_at", "2023-04-08 15:46:54.314888"], ["updated_at", "2023-04-08 15:46:54.314888"]]