app/controllers/dashboards_controller.rb

  def show;
    if current_admin.present?
      email = current_admin.email
      user = User.where('email' => email).first

      unless user.present?
        new_user = User.new

        new_user.email = email
        new_user.full_name = current_admin.full_name
        new_user.phone_number = "None provided"
        new_user.save!
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "raulescobar_g@tamu.edu"], ["LIMIT", 1]]
INSERT INTO "users" ("full_name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "mnr282001@tamu.edu"], ["email", "mnr282001@tamu.edu"], ["phone_number", "None provided"], ["created_at", "2023-04-08 12:33:41.538824"], ["updated_at", "2023-04-08 12:33:41.538824"]]