app/controllers/event_members_controller.rb

SELECT "event_members".* FROM "event_members"
---
  def index
    @event_members = EventMember.all

INSERT INTO "event_members" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["user_id", 1], ["created_at", "2023-02-10 17:23:08.714263"], ["updated_at", "2023-02-10 17:23:08.714263"]]
---
  def create
    @event_member = EventMember.new(event_member_params)

    respond_to do |format|
      if @event_member.save

DELETE FROM "event_members" WHERE "event_members"."id" = $1  [["id", 18]]
---
  def destroy
    @event_member.destroy!

SELECT "event_members".* FROM "event_members" WHERE "event_members"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def set_event_member
    @event_member = EventMember.find(params[:id])