app/controllers/events_controller.rb

  def index
    @current_id = User.where('email' => current_admin.email).first.id
    @events = Event.all
    @user_event_array = EventMember.where('user_id' => @current_id).to_a
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "brandon.longuet@yahoo.com"], ["LIMIT", 1]]
SELECT "events".* FROM "events"
SELECT "event_members".* FROM "event_members" WHERE "event_members"."user_id" = $1  [["user_id", 12]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "raulescobar_g@tamu.edu"], ["LIMIT", 1]]

  def show
    # on showing event, get user names that belong to that event, and make global variable to be used in html
    @users = User.select('full_name').joins(:event_members).where('event_members.event_id' => params[:id])
---
SELECT "users"."full_name" FROM "users" INNER JOIN "event_members" ON "event_members"."user_id" = "users"."id" WHERE "event_members"."event_id" = $1  [["event_id", 33]]
SELECT "events"."id" FROM "events" INNER JOIN "event_members" ON "event_members"."event_id" = "events"."id" WHERE "event_members"."user_id" = $1  [["user_id", 10]]

  def create
    @event = Event.new(event_params)

    unless @event.valid?
      respond_to do |format|
        format.html { render(:new, status: :unprocessable_entity) }
        format.json { render(json: @event.errors, status: :unprocessable_entity) }
      end
      return
    end

    begin
      # create event in google calendar
      client = fetch_client

      if client.blank?
        flash[:error] = 'Failed to fetch google service account. Contace admin for help.'
        redirect_to(new_event_url)
        return
      end

      google_event = create_google_event(@event)

      if google_event.blank?
        flash[:error] = 'Failed to create google event.'
        redirect_to(new_event_url)
        return
      end

      result, err = client.insert_event(ENV.fetch('GOOGLE_CALENDAR_ID', nil), google_event)
---
INSERT INTO "events" ("name", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sdffsdfs"], ["start", "2023-03-29 17:21:00"], ["end", "2023-03-29 18:21:00"], ["created_at", "2023-03-29 22:21:14.410052"], ["updated_at", "2023-03-29 22:21:14.410052"]]

    end

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "start", "end", "created_at", "updated_at", "google_event_id", "location", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    updated_event = Event.new(event_params)

    begin
      # create event in google calendar
      client = fetch_client

      if client.blank?
        flash[:error] = 'Cannot access google service account. Contact admin for help.'
        redirect_to(event_url)
        return
      end

      google_event = create_google_event(updated_event)

      if google_event.blank?
        flash[:error] = 'Failed to update google event.'
        redirect_to(event_url)
        return
      end

      _result, err = client.update_event(ENV.fetch('GOOGLE_CALENDAR_ID', nil), @event.google_event_id, google_event)
---
UPDATE "events" SET "name" = $1, "end" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "UPDATED2"], ["end", "2023-03-29 20:11:00"], ["updated_at", "2023-03-29 23:12:15.609568"], ["id", 34]]

    end

    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "name" = $1, "end" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["name", "UPDATED2"], ["end", "2023-03-29 20:11:00"], ["updated_at", "2023-03-29 23:12:15.609568"], ["id", 34]]

  def destroy
    begin
      # create event in google calendar
      client = fetch_client

      if client.blank?
        flash[:error] = 'Failed to fetch google service account. Contact admin for help.'
        redirect_to(event_url)
        return
      end

      _result, err = client.delete_event(ENV.fetch('GOOGLE_CALENDAR_ID', nil), @event.google_event_id)

      if err.present?
        flash[:error] = 'Failed to delete google event from calendar.'
        redirect_to(event_url)
        return
      end
    rescue StandardError => _e
      flash[:error] = 'Error occurred. Contact admin for details.'
      redirect_to(event_url)
      return
    end

    @event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 33]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]