app/controllers/events_controller.rb

SELECT "events"."id" FROM "events" INNER JOIN "event_members" ON "event_members"."event_id" = "events"."id" WHERE "event_members"."user_id" = $1  [["user_id", 2]]
---
  def index
    @current_id = User.where('email' => current_admin.email).first
    @events = Event.all
    @user_event_array = Event.select('id').joins(:event_members).where('event_members.user_id' => @current_id.id).to_a.map(&:id)

INSERT INTO "events" ("name", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "meeting"], ["start", "2023-02-10 11:22:00"], ["end", "2023-02-10 00:22:00"], ["created_at", "2023-02-10 17:22:28.749391"], ["updated_at", "2023-02-10 17:22:28.749391"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save