app/controllers/forum_posts_controller.rb

    def index
        @forum_posts = ForumPost.all.order("created_at DESC")
---
SELECT "forum_posts".* FROM "forum_posts" ORDER BY created_at DESC

    def create
     @forum_post = ForumPost.new(forum_post_params)

     if @forum_post.save
---
INSERT INTO "forum_posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "wdjks"], ["content", "jfpewod"], ["created_at", "2023-04-08 13:47:57.822333"], ["updated_at", "2023-04-08 13:47:57.822333"]]

   def update
     if @forum_post.update(forum_post_params)
---
UPDATE "forum_posts" SET "content" = $1, "updated_at" = $2 WHERE "forum_posts"."id" = $3  [["content", "jnkj"], ["updated_at", "2023-04-08 13:23:29.624068"], ["id", 1]]

    def find_forum_post
        @forum_post = ForumPost.find(params[:id])
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]