app/controllers/groups_controller.rb

  def index
    @current_id = User.where('email' => current_admin.email).first
    @groups = Group.all
    @user_group_array = Group.select('id').joins(:group_members).where('group_members.user_id' => @current_id.id).to_a.map(&:id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "brandon.longuet@yahoo.com"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
SELECT "groups"."id" FROM "groups" INNER JOIN "group_members" ON "group_members"."group_id" = "groups"."id" WHERE "group_members"."user_id" = $1  [["user_id", 2]]

  def show
    # on showing group, get user names that belong to that group, and make global variable to be used in html
    @users = User.select('full_name').joins(:group_members).where('group_members.group_id' => params[:id])
    @current_id = User.where('email' => current_admin.email).first
    @user_group_array = Group.select('id').joins(:group_members).where('group_members.user_id' => @current_id.id).to_a.map(&:id)
---
SELECT "groups"."id" FROM "groups" INNER JOIN "group_members" ON "group_members"."group_id" = "groups"."id" WHERE "group_members"."user_id" = $1  [["user_id", 1]]
SELECT "users"."full_name" FROM "users" INNER JOIN "group_members" ON "group_members"."user_id" = "users"."id" WHERE "group_members"."group_id" = $1  [["group_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "raulescobar_g@tamu.edu"], ["LIMIT", 1]]

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bababui"], ["description", "nope"], ["created_at", "2023-03-30 21:02:35.430409"], ["updated_at", "2023-03-30 21:02:35.430409"]]

  def destroy
    @group.destroy!
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]