app/controllers/group_members_controller.rb

SELECT "group_members".* FROM "group_members"
---
  def index
    @group_members = GroupMember.all

INSERT INTO "group_members" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["user_id", 2], ["created_at", "2023-02-10 17:23:19.623679"], ["updated_at", "2023-02-10 17:23:19.623679"]]
---
  def create
    @group_member = GroupMember.new(group_member_params)

    respond_to do |format|
      if @group_member.save

DELETE FROM "group_members" WHERE "group_members"."id" = $1  [["id", 26]]
---
  def destroy
    @group_member.destroy!

SELECT "group_members".* FROM "group_members" WHERE "group_members"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def set_group_member
    @group_member = GroupMember.find(params[:id])