app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "raulescobar_g@tamu.edu"], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "admin_id", "admin_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "khgbhiuk"], ["body", "09h"], ["user_id", 1], ["created_at", "2023-04-08 14:57:44.198666"], ["updated_at", "2023-04-08 14:57:44.198666"], ["admin_id", nil], ["admin_name", nil]]
---
  def create
    current_user = User.where('email' => current_admin.email).first
    @post = Post.new({ 'title' => post_params[:title], 'body' => post_params[:body], 'user' => current_user })

    respond_to do |format|
      if @post.save