app/controllers/replies_controller.rb

  def index
    @replies = Reply.all
---
SELECT "replies".* FROM "replies"

  def destroy
    @reply.destroy!
---
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 1]]

  def set_reply
    @reply = Reply.find(params[:id])
---
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]