app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "raulescobar_g@tamu.edu"], ["LIMIT", 1]]
INSERT INTO "users" ("full_name", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", "Raul Escobar"], ["email", "raulescobar_g@tamu.edu"], ["phone_number", "0000000000"], ["created_at", "2023-04-01 15:19:52.723202"], ["updated_at", "2023-04-01 15:19:52.723202"]]
---
  def create
    @user = User.new(user_params)

    other_user = User.where('email' => @user.email).first

    # dont duplicate users
    if other_user.present?
      respond_to do |format|
        format.html { redirect_to(user_url(other_user), info: 'User already exists') }
        format.json { render(:show, status: :created, location: @user) }
      end
    else
      respond_to do |format|
        if @user.save

UPDATE "users" SET "full_name" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["full_name", "Nayab Rehmat"], ["phone_number", "8326809809"], ["updated_at", "2023-04-10 16:19:29.373068"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
  def destroy

    # logout if you destroy yourself
    if current_admin.email == @user.email
      path = "/admins/sign_out"
    else
      path = users_url
    end

    @user.destroy!